Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: Translations are displayed with the following functions in the source code:
ja: 翻訳文はソースコード中の以下の関数で表示されます。

source: Execute this command: `tail -f /var/log/messages`.
ja: コマンド: `tail -f /var/log/messages` を実行する。

source: In this way, you can extend the default filters easily and save most used search queries.
ja: この方法では、デフォルトのフィルタを容易に拡張し、よく使う検索クエリを保存できます。

source: Copy your custom ``config.php`` if you have one 4.
ja: もし ``config.php`` をカスタムしてるなら、それもコピーする 4.

source: CSS code --------
ja: CSS コード --------

source: - Users authenticated by a reverse-proxy
ja: - リバースプロキシによるユーザー認証

source: // Lock account duration in minute define('BRUTEFORCE_LOCKDOWN_DURATION', 15);
ja: // アカウントのロック期間(分) define('BRUTEFORCE_LOCKDOWN_DURATION', 15);

source: All parameters of this example are mandatory.
ja: この例に出ているすべてのパラメータは必須です。

source: - Purpose: **Get all members of a project**
ja: - 用途: **プロジェクトのメンバー全てを取得する**

source: Export/Backup -------------
ja: エクスポート/バックアップ -------------

source: - PHP native mail function
ja: - PHP ネイティブのメール機能

source: - Activated notifications in their profile
ja: - ユーザープロフィールで通知を有効にする

source: - Find tasks into several links:
ja: - 複数のタスクリンクで検索:

source: // Enable LDAP authentication (false by default)
ja: // LDAP 認証を有効にする (デフォルトは false )

source: As of version 1.0.16 Kanboard can be found in FreeBSD ports there is no need to install it manually.
ja: Kanboard 1.0.16 はFreeBSD portsにあるので、手動インストールは必要ありません。

source: Tasks CSV export ~~~~~~~~~~~~~~~~
ja: タスクをCSVでエクスポート ~~~~~~~~~~~~~~~~

source: CSV data are sent to ``stdout``.
ja: CSVデータは `stdout`に送られます。

source: Open the “Task Scheduler” 3.
ja: “タスクスケジューラ”を開く 3.

source: - **values** (array, required)
ja: - **値** (連想配列, 必須)

source: - Interviews
ja: - 面接

source: We recommend to switch to the last version of PHP because it’s bundled with `OPcache <http://php.net/manual/en/intro.opcache.php>`__.
ja: 我々は最終バージョンのPHPと、それにバンドルされる `OPcache <http://php.net/manual/en/intro.opcache.php>`__ に切り替えることを推奨します。

source: Each time a failure event occurs, the counter of failed logins is incremented.
ja: 認証失敗イベントが起こる都度、ログイン失敗カウンターが加算されます。

source: - Command-Control-Shift-3: Take a screenshot of the screen, and save it to the clipboard
ja: - Command-Control-Shift-3: 画面全体のスクリーンショットがクリップボードに保存される

source: - No permission checked
ja: - 権限のチェックをしない

source: Time tracking information can be defined at the task level or at the subtask level.
ja: 時間の追跡情報は、タスクのレベルもしくはサブタスクのレベルによって定義され得ます。

source: - Click the down-arrow next to **Other calendars**.
ja: - 「↓」の次にある、 **その他のカレンダー** をクリックする

source: - Move the task to another column when assigned to a user
ja: - ユーザーの割当てをしたらタスクを他のカラムに移動

source: Only administrators are allowed to install plugins from the user interface.
ja: システム管理者だけがユーザーインターフェースからプラグインをインストールできます。

source: Event Listening ---------------
ja: イベントを監視 ---------------

source: plugin:install Install a plugin from a remote Zip archive
ja: plugin:install リモートのzipアーカイブからプラグインをインストールする

source: - **recurrence_status** (integer, optional)
ja: - **recurrence_status** (integer, 任意)

source: If you use a smartphone, the easiest solution is to scan the QR code with FreeOTP or Google Authenticator.
ja: スマートフォンを使用しているならば、もっとも簡単なのはFreeOTPかGoogle認証でQRコードをスキャンする方法です。

source: Time Spent Into Each Column ~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 各カラムの経過時間 ~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Template hooks allow additional content in existing templates.
ja: フックのテンプレートは既存のテンプレートに内容を追加することができます。

source: To fetch the value of the variable you can use the method ``getStringParam()`` or ``getIntegerParam()`` from the class ``Kanboard\Core\Http\Request``:
ja: 変数の値を取得するには、 ``Kanboard\Core\Http\Request`` クラスの ``getStringParam()`` か、 ``getIntegerParam()`` クラスを使用できます:

source: // If this filter is configured, Kanboard will search user groups in LDAP_GROUP_BASE_DN
ja: // このフィルターが設定されている場合、Kanboardはユーザーグループを LDAP_GROUP_BASE_DN から探します。

source: * Send notification to a project
ja: * プロジェクトに通知を送る

source: // Enable/disable email configuration from the user interface define('MAIL_CONFIGURATION', true);
ja: // ユーザーインターフェースからの email 設定の有効化/無効化 define('MAIL_CONFIGURATION', true);

source: - `Official Kanboard images <https://hub.docker.com/r/kanboard/kanboard/>`__ - `Docker documentation <https://docs.docker.com/>`__ - Since Kanboard > v1.1.0, the tag "stable" is not used anymore - Since Kanboard > v1.2.5, the tag "latest" point to the latest stable release instead of the master branch - To send emails, you must use the SMTP method or a plugin like Mailgun/Sendgrid/Postmark
ja: - `Kanboard 公式イメージ <https://hub.docker.com/r/kanboard/kanboard/>`__ - `Docker の文書 <https://docs.docker.com/>`__ - Kanboard v1.1.0より前では、 "stable" タグは使用されていません - Kanboard v1.2.5より後では、 "latest" タグはmasterブランチの代わりに最新安定リリースを示します - EMailを送るには、SMTPを使用するか、Mailgun/Sendgrid/Postmarkプラグインを使用しなければなりません

source: - Hostname: **localhost**
ja: - ホスト名: **localhost**

source: Translations are stored in a dictionary, if you would like to override an existing string, you just need to use the same key in your translation file.
ja: 翻訳は連想配列として保存されていて、既知の文をオーバーライドしたいならば、翻訳ファイル中で同じキーを使用するだけで済みます。

source: This calendar shows tasks with defined due date and tasks based on the creation date or the start date.
ja: このカレンダーは定められた期限日とタスクの作成日か開始日を基にしてタスクをカレンダーに表示します。

source: Example for OpenLDAP with Posix Groups: ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: OpenLDAP と Posix Groups による例: ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - **role** (string, optional, example: app-admin, app-manager, app-user)
ja: - **role** (string, 任意。例: app-admin, app-manager, app-user)

source: - The Two-Factor TOTP method implements ``PostAuthenticationProviderInterface``
ja: - 二要素認証(TOTP) メソッドの実装は ``PostAuthenticationProviderInterface`` です。

source: You can click on the drop-down menu on the table to add a new restriction:
ja: ドリップダウンメニュー上の票をクリックすれば、新しい制限を追加できます:

source: // If set to false, you will have to run manually the SQL migrations from the CLI during the next Kanboard upgrade
ja: // これをfalseにした場合、Kanboardのアップグレード作業中にSQLのマイグレーションをCLIから手動で行わなければなりません。

source: // LDAP DN for users
ja: // LDAP のユーザー識別名

source: - Linux/Unix machine
ja: - Linux/Unix マシン

source: projects
ja: プロジェクト

source: However, it’s possible to use other methods, the SMTP protocol and Sendmail.
ja: しかしながら、別の方法も利用可能で、それはSMTPプロトコルとSendmailです。

source: - Compact/wide view = **c**
ja: - コンパクト/ワイドビュー = **c**

source: A secret key is generated for you
ja: あなたの秘密鍵が生成されます。

source: New authentication backends can be written with very few lines of code.
ja: 新しい認証のバックエンドは非常に少ない行数のコードで書くことができます。

source: - Choose action: **Assign a color to a specific user**
ja: - アクション: **色をユーザーに割当てる** を選択

source: Check database schema version ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: データベースのスキーマのバージョンを確認する ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: // Run automatically database migrations // If set to false, you will have to run manually the SQL migrations from the CLI during the next Kanboard upgrade // Do not run the migrations from multiple processes at the same time (example: web page + background worker) define('DB_RUN_MIGRATIONS', true);
ja: // 自動的にデータベースのマイグレーションを実行する // これをfalseにした場合、Kanboardのアップグレード作業中にSQLのマイグレーションをCLIから手動で行わなければなりません。 // 同時に複数のプロセスからマイグレーションを実行してはいけません (例: web ページ + バックグラウンドワーカー) define('DB_RUN_MIGRATIONS', true);

source: When you change the value of these fields, **the task time tracking values are updated automatically and becomes the sum of all subtask values**.
ja: これらのフィールドの値を変更したとき、 **自動的に、全てのサブタスクの合計の値がタスクの時間追跡の値として更新されます。**

source: Adding Automatic Actions ========================
ja: 自動アクションを追加する ========================

source: Basically, you need to define:
ja: 基本的には、以下を定義する必要があります:

source: To upload the image in the user profile, Active Directory administrators may use software like `AD Photo Edit <http://www.cjwdev.co.uk/Software/ADPhotoEdit/Info.html>`__.
ja: ユーザープロファイルの画像をアップロードするために、 Active Directoryの管理者は `AD Photo Edit <http://www.cjwdev.co.uk/Software/ADPhotoEdit/Info.html>`__ のようなソフトウェアを利用できます。

source: User Repartition ----------------
ja: 担当者分布 ----------------

source: // Enable or disable "X-Frame-Options: DENY" HTTP header define('ENABLE_XFRAME', true);
ja: // "X-Frame-Options: DENY" HTTP ヘッダの有効化/無効化 define('ENABLE_XFRAME', true);

source: - Recurring tasks are duplicated to the first column of the board when the selected events occur
ja: - 反復タスクは事前に決めておいたイベントが起きた時に、タスクをボード上の最初のカラムに複製します。

source: - **values** (dict, required)
ja: - **値** (連想配列, 必須)

source: - **column_id** (integer, required)
ja: - **column_id** (integer, 必須)

source: Instructions ------------
ja: インストラクション ------------

source: When you share a board, the page will refresh every 60 seconds automatically by default.
ja: ボードを共有していると、ページはデフォルトで60秒ごとに自動更新されます。

source: - Purpose: **Get all available comments**
ja: - Purpose: **全ての利用可能なコメントを取得**

source: // Sendmail command to use when the transport is "sendmail" define('MAIL_SENDMAIL_COMMAND', '/usr/sbin/sendmail -bs');
ja: // "sendmail" での送信を選んだときに sendmail コマンドが使用する設定 define('MAIL_SENDMAIL_COMMAND', '/usr/sbin/sendmail -bs');

source: - **user_id** (int, optional)
ja: - **user_id** (int, 任意)

source: Another example with MariaDB:
ja: これは MariaDB での例です:

source: - With this view, all results of your search are displayed in a table.
ja: - このビューは、検索した結果を一覧で表示します。

source: If the group doesn’t exist in the local database, it will be automatically synced.
ja: ローカルのデータベース上にそのグループが存在しない場合、自動的に同期されます。

source: - Purpose: **Create a private project for the logged user**
ja: - 用途: **ログインしたユーザーでプライベートプロジェクトを作成する**

source: By default, those credentials are used:
ja: デフォルトでは、以下の資格情報を使用します:

source: Then start Apache:
ja: その後Apacheを起動する:

source: - Choose the colors and other settings and finally save
ja: - 色を選択して、その他の設定をしてから、最後に保存する

source: figure:: /_static/example-restrictions.png :alt: List of restrictions
ja: figure:: /_static/example-restrictions.png :alt: 制限のリスト

source: When the LDAP authentication is activated, the login process works like that:
ja: LDAP認証が有効な場合、ログインプロセスは下記のように働きます:

source: It’s disabled by default.
ja: デフォルトでは無効です。

source: Web notifications are available from the dashboard or from the icon at the top:
ja: Web通知はダッシュボードか、画面上部のアイコンから利用可能です。

source: Check the Apache installation ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: Apache のインストールの確認 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Important things to do before updating --------------------------------------
ja: アップグレードを実行する前の重要な事 --------------------------------------

source: - Purpose: **Get the project roles**
ja: - 用途: **プロジェクトでの役割を取得する**

source: - Purpose: **Get list of events compatible with an action**
ja: - 用途: **アクションと互換性があるイベントの一覧を取得する**

source: +-----------------------------------------+-------------------------------------------+ | Interface | Role | +=========================================+===========================================+ | AuthenticationProviderInterface | Base interface for other authentication | | | interfaces | +-----------------------------------------+-------------------------------------------+ | PreAuthenticationProviderInterface | The user is already authenticated when | | | reaching the application, web servers | | | usually define some environment variables | +-----------------------------------------+-------------------------------------------+ | PasswordAuthenticationProviderInterface | Authentication methods that uses the | | | username and password provided in the | | | login form | +-----------------------------------------+-------------------------------------------+ | OAuthAuthenticationProviderInterface | OAuth2 providers | +-----------------------------------------+-------------------------------------------+ | PostAuthenticationProviderInterface | Two-Factor auhentication drivers, ask for | | | confirmation code | +-----------------------------------------+-------------------------------------------+ | SessionCheckProviderInterface | Providers that are able to check if the | | | user session is valid | +-----------------------------------------+-------------------------------------------+
ja: +-----------------------------------------+-------------------------------------------+ | インターフェース | 役割 | +=========================================+===========================================+ | AuthenticationProviderInterface | 他の認証インターフェースの土台となる | | | インターフェース | +-----------------------------------------+-------------------------------------------+ | PreAuthenticationProviderInterface | アプリケーションを開いた時に | | | 既にユーザーが認証を済ませている時に | | | いくつかの環境変数を定義するのに使用される | +-----------------------------------------+-------------------------------------------+ | PasswordAuthenticationProviderInterface | ログインフォーム内でユーザー名と | | | パスワードでの認証を提供するメソッド | +-----------------------------------------+-------------------------------------------+ | OAuthAuthenticationProviderInterface | OAuth2 認証を提供する | +-----------------------------------------+-------------------------------------------+ | PostAuthenticationProviderInterface | 2要素認証で、確認コードを | | | 問い質すドライバ | +-----------------------------------------+-------------------------------------------+ | SessionCheckProviderInterface | ユーザーのセッションが有効か | | | 確認できるようにするプロバイダ | +-----------------------------------------+-------------------------------------------+

source: Roles are defined in the class ``Kanboard\Core\Security\Role``.
ja: 役割は ``Kanboard\Core\Security\Role`` クラスで定義されます。

source: - The timer records the time spent on the subtask automatically.
ja: - タイマーは自動的にサブタスクの経過時間を記録します。

source: Available from the task view, you can see that information:
ja: タスクビューから、これらの情報が利用できます:

source: Example of Query ----------------
ja: クエリの例 ----------------

source: PHP and Apache are compiled with Visual Studio so you need to install this library if it’s not already done.
ja: PHP と Apache はVisual Studioでコンパイルされているため、まだVC++ Redistributableを導入していない場合には、このライブラリをインストールする必要があります。

source: figure:: /_static/tags-global.png :alt: Global Tags
ja: figure:: /_static/tags-global.png :alt: グローバルタグ

source: - `Microsoft IIS 7.0 and later <http://php.net/manual/en/install.windows.iis7.php>`__
ja: - `Microsoft IIS 7.0 以降 <http://php.net/manual/en/install.windows.iis7.php>`__

source: Kanboard uses Sqlite by default to store its data.
ja: Kanboardは Sqlite にデータを保存します。

source: - Choose action: **Move the task to another project**
ja: - アクション: **- タスクを別プロジェクトに移動** を選択

source: Example to add events in the user calendar:
ja: ユーザーのカレンダーにイベントを追加する例:

source: Running SQL migrations manually -------------------------------
ja: 手動でのSQLマイグレーション -------------------------------

source: Request example:
ja: リクエスト例:

source: - ``Kanboard\Core\ExternalTask\NotFoundException``: External task not found
ja: - ``Kanboard\Core\ExternalTask\NotFoundException``: 外部タスクが見つからない

source: Group Provider Workflow -----------------------
ja: グループプロバイダのワークフロー -----------------------

source: - The subscription link is unique per project, the link is activated when you enable the public access of your project: **Project settings > Public access**.
ja: - 配信リンクはプロジェクト毎にユニークで、 **プロジェクト設定 > 公開アクセス** で公開アクセスを有効化したときにリンクがアクティブになります。

source: Response example:
ja: レスポンスの例:

source: Reverse Proxy Authentication ============================
ja: リバースプロキシ認証 ============================

source: - The constant ``VERSION`` is the last version of your schema
ja: - 定数 ``VERSION`` はスキーマの最新版です。

source: This link is visible only if you are administrators.
ja: このリンクはシステム管理者だけに見えます。

source: // Example for ActiveDirectory: '(&(objectClass=user)(sAMAccountName=%s))'
ja: // ActiveDirectoryでの例: '(&(objectClass=user)(sAMAccountName=%s))'

source: Go to the “permissions” section on the left menu and assign the desired role to the user.
ja: 左のメニューの“権限” セクションに移動し、望ましい役割をユーザーに割当ててください。

source: The user will only be created if he is found on the LDAP server.
ja: LDAPサーバー上のユーザーがいる場合のみKanboardのユーザーが作成されます。

source: ### Title level 3
ja: ### 見出し level 3

source: +----------------+---------------------------------------------------+ | Type | Usage | +================+===================================================+ | Sqlite | Single user or small team (almost no concurrency) | +----------------+---------------------------------------------------+ | Mysql/Postgres | Larger team, high-availability configuration | +----------------+---------------------------------------------------+
ja: +----------------+---------------------------------------------------+ | タイプ | 使用法 | +================+===================================================+ | Sqlite | 一人もしくは小規模チーム (殆ど並行が無い) | +----------------+---------------------------------------------------+ | Mysql/Postgres | 大規模チーム, 高可用性設定にする | +----------------+---------------------------------------------------+

source: Kanboard use internally the `Symfony EventDispatcher component <https://symfony.com/doc/2.3/components/event_dispatcher/index.html>`__ to manage internal events.
ja: Kanboard は内部で `Symfony EventDispatcher component <https://symfony.com/doc/2.3/components/event_dispatcher/index.html>`__ を内部イベントの管理に使用しています。

source: The PHPUnit config file is ``tests/acceptance.xml``.
ja: PHPUnit の設定ファイルは ``tests/acceptance.xml`` です。

source: - Administrators and project administrators can convert a private project to a multiple-user project by changing the checkbox "Private project".
ja: - 組織の管理者とプロジェクトの管理者は"プライベートプロジェクト"のチェックボックスを変更することで、プライベートプロジェクトをチームプロジェクトに変更することができます。

source: For example, it’s useful to separate software releases, divide your tasks in different products, teams or whatever you want.
ja: 例えば、ソフトウェアのリリースで分けたり、製品やチーム別で分離したり、その他何にでも使えます。

source: - Before doing any large changes, open a new ticket to start a discussion.
ja: - 大きな変更をする前に、議論の為に新しいチケットを開いてください。

source: However, if you always create the same categories for all your projects, you can define here the list of categories to create automatically.
ja: しかしながら、どのプロジェクトでもいつも同じカテゴリを作成しているならば、ここで自動的に作成するカテゴリのリストを定義できます。

source: - **project_id** (integer, required) - **event_name** (string, required) - **action_name** (string, required) - **params** (key/value parameters, required)
ja: - **project_id** (integer, 必須) - **event_name** (string, 必須) - **action_name** (string, 必須) - **params** (key/value parameters, 必須)

source: - Purpose: **Get the list of task colors**
ja: - 用途: **タスクの色の一覧を取得する**

source: - Your browser is Internet Explorer
ja: - ブラウザにIEを使用している

source: Trigger automatically subtask time tracking ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: サブタスクを自動で時間追跡するトリガ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - Go to the project calendar #5: **/c/5**
ja: - プロジェクト #5 のカレンダーを表示: **/c/5**

source: - Bring focus and avoid multitasking by setting a work-in-progress limit per column
ja: - 各カラムで仕掛制限を設定することにより、同時処理の回避に重点を置きます

source: Go to the task view and choose **Duplicate** on the left.
ja: タスクビューを開いてから、左の **複製** を選択してください。

source: You can then assign the required permissions on the database:
ja: それからデータベースに必要なアクセス権を割当てることができます:

source: - LDAP attributes must be lowercase.
ja: - LDAP 属性は小文字である必要があります。

source: HTML output when URL rewriting is not enabled:
ja: URL rewriting が有効になっていない場合の HTML 出力:

source: - This is a free and open source project, no one owes you anything.
ja: - これは自由でオープンソースなプロジェクトで、誰か一人のためではありません。

source: # Set size limit to 20MB
ja: # サイズ上限を 20MB にする

source: The recommended authentication method is ``Proxy``.
ja: 推奨する認証方法は ``Proxy`` です。

source: - Result on success: **link properties**
ja: - 成功時の返り値: **リンクのプロパティ**

source: Hooks can extend, replace, filter data or change the default behavior.
ja: フックは拡張、置き換えが可能で、デフォルトでの動作はデータのフィルタリングや変更です。

source: Use your own server.
ja: 自身のサーバーを利用してください。

source: note:: Since the version 1.2.3, Kanboard uses the utf8mb4 encoding instead of utf8.
ja: 注意:: Kanboard1.2.3以降では、utf8に替えてutf8mb4を使用します。

source: - Find tasks for several columns: ``column:"Backlog" column:ready``
ja: - 複数のカラムからタスクを検索: ``column:"Backlog" column:ready``

source: - ``LDAP_GROUP_BASE_DN``: Distinguished names to find groups in LDAP directory
ja: - ``LDAP_GROUP_BASE_DN``: LDAPディレクトリでのグループ識別名

source: If the parameter ``DB_RUN_MIGRATIONS`` is set to ``false``, you have run the database migrations manually:
ja: ``DB_RUN_MIGRATIONS`` パラメーターを ``false`` に設定した場合、データベースのマイグレーションを手動で行う必要があります。

source: - ``%s`` is used to replace a string
ja: - ``%s`` は文字列(string)の置き換えに使用されます。

source: Configuration File ==================
ja: 設定ファイル ==================

source: - The LDAP method implements ``PasswordAuthenticationProviderInterface``
ja: - LDAPを利用するメソッドでの実装は ``PasswordAuthenticationProviderInterface`` です。

source: - title
ja: - タイトル

source: - Result on success: **file properties**
ja: - 成功時の返り値: **ファイルのプロパティ**

source: // We choose "smtp" as mail transport define('MAIL_TRANSPORT', 'smtp');
ja: // "smtp"をメール送信方法として選択する define('MAIL_TRANSPORT', 'smtp');

source: |Deploy| image:: https://www.herokucdn.com/deploy/button.png :target: https://heroku.com/deploy?template=https://github.com/kanboard/kanboard
ja: |デプロイ| image:: https://www.herokucdn.com/deploy/button.png :target: https://heroku.com/deploy?template=https://github.com/kanboard/kanboard

source: - The default swimlane is always shown at the top
ja: - 既定スイムレーンは常に最上部に表示されます。

source: This method **is not perfect**.
ja: この方法は **完全ではありません** 。

source: RSS/Atom Subscriptions ======================
ja: RSS/Atom フィード ======================

source: - Always backup your data
ja: - いつもデータのバックアップを取ってください。

source: Use the content of the French locales and replace the values 4.
ja: フランス語のロケールの内容を使用した上で、値を置き換える 4.

source: In your ``Plugin.php``, just call the method ``register()`` from the object ``ExternalLinkManager``:
ja: ``Plugin.php`` 内では、単に ``ExternalLinkManager`` オブジェクトから ``register()`` メソッドを呼び出すだけです:

source: Kanboard retrieve the username from the request
ja: Kanboard はユーザー名をリクエストから取得します。

source: - A translation is a PHP file that returns an Array with a key-value pairs
ja: - 翻訳ファイルはPHPのファイルで、キーと値のペアの配列を返します。

source: Technically, the database is just a single file located inside the directory ``data`` and named ``db.sqlite``.
ja: 技術的には、データベースは ``data`` ディレクトリ内の ``db.sqlite`` という名前の単一のファイルです。

source: - Purpose: **Disable a swimlane**
ja: - 用途: **スイムレーンを無効化する**

source: Use 3 backticks with eventually the language name.
ja: 3つのバッククォートを言語名と共に使用してください。

source: Add a restriction to the role ''''''''''''''''''''''''''''''''
ja: 役割に制限を追加する ''''''''''''''''''''''''''''''''

source: For each project, tasks can be visualized with several views: **Board, Calendar, List and Gantt**.
ja: 各々のプロジェクトは、いくつかのビューで可視化されます: **ボードビュー, カレンダービュー, リスト, ガントチャート** があります。 (訳注:カレンダーとガントチャートは外部プラグインが必要)

source: This feature allows you to sync automatically LDAP groups with Kanboard groups.
ja: この機能はLDAPのグループとKanboardのグループを自動的に同期することを可能にします。

source: This method is called for each request when the plugin is loaded.
ja: このメソッドはプラグインがロードされる時の要求の都度呼ばれます。

source: - If Apache is a reverse proxy to another Apache running Kanboard, the header ``REMOTE_USER`` is not set (same behavior with IIS and Nginx).
ja: - Kanboardを動かしているApacheとは別のApacheをリバースプロキシとしている場合、 ``REMOTE_USER``ヘッダーはセットされません (IISとかNginxと同じ動作)

source: Describe the actual behavior:
ja: 実際の動作の詳細:

source: Creating a Private Project ~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: プライベートプロジェクトの作成 ~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - **Description**: Description that use the Markdown syntax.
ja: - **概要**: 概要はMarkdown記法を使用します。

source: Apache Auth on the same server or a well-configured reverse proxy.
ja: 同じサーバー上のApache Auth か、 十分な設定がされたリバースプロキシ。

source: // Lock account duration in minutes define('BRUTEFORCE_LOCKDOWN_DURATION', 15);
ja: // アカウントのロック期間(分) define('BRUTEFORCE_LOCKDOWN_DURATION', 15);
